---
kind: type
id: T:Autodesk.Revit.DB.ExternalService.ExternalServices
source: html/12a99399-0a75-d501-ab77-f7c5db83e361.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices

Provides a container of all Revit built-in ExternalServiceId instances.

## Syntax (C#)
```csharp
public static class ExternalServices
```